raw/Creating-and-Running-Unit-Tests-Directly-in-Source-Files-with-Org-mode.org
#+TITLE: Creating-and-Running-Unit-Tests-Directly-in-Source-Files-with-Org-mode
#+URL: http://fgiasson.com/blog/index.php/2016/05/30/creating-and-running-unit-tests-directly-in-source-files-with-org-mode/
#+AUTHOR: lujun9972
#+CATEGORY: raw
#+DATE: [2016-09-14 三 14:53]
#+OPTIONS: ^:{}

Developing a computer program is not an easy task. The process needs a constant focus. Any interruption of
that process means that time is spent re-focusing on it and errors are more prone to be introduced. The
process involves analyzing a problem to solve by executing a series of steps. It involves writing about the
problem we are trying to solve and writing about the solution we found to solve it. Finally it involves
writing test procedures that can run to make sure that the current state of the implementation of the solution
behaves as expected and that expected behavior is not altered by subsequent modifications.

The problem I have been struggling with for the past 19 years — common to all programmers — is that each part
of this development process was performed in a cascade. The tools available, and the methods employed, forced
me to perform each of these steps in isolation and then to iterate how to:

 1. Analyze a problem
 2. Code a solution to the problem
 3. Document the implementation
 4. Create tests for the implementation
 5. If the problem changed, or the solution needed fixing, iterate these same isolated steps from from 1 to 4.

The problem is that keeping the focus, and more importantly having the willpower (literally) to perform each
step under the pressure of deadlines, between meetings, etc., is nearly impossible to do right. Normally the
steps 1 and 2 will be done, but then steps 3 and 4 will be postponed until tomorrow (which never comes…)

I don’t think there is any definitive solution to solve this situation. Developing computer programs won’t
ever be an easy task, and focus will always be warranted. However I think there are methodologies and tools
that can be adopted to smooth the process. But one best practice that I think goes quite a bit of the way to
address this problem is to have a single document become the focal point of the overall process.

What we want is to be able to perform the process with a single tool and in a single document such that we
only have to focus on it without having to refocus on different tools in different windows all the time during
the development process.

In this blog post, I will describe a way to develop, and run, the unit tests (step 4) while keeping the focus
on writing about the solution and implementing it, all in the same (Org-mode) document.

This blog post belong to a series of posts about Literate [Clojure] Programming:

  * [[http://fgiasson.com/blog/index.php/2016/07/06/literate-clojure-programming-using-org-mode/][Project folder structure]]
  * [[http://fgiasson.com/blog/index.php/2016/08/11/literate-clojure-programming-anatomy-of-a-org-mode-file/][Anatomy of a Org-mode file]]
  * Tangling all project files
  * Publishing documentation in multiple formats
  * [[http://fgiasson.com/blog/index.php/2016/05/30/creating-and-running-unit-tests-directly-in-source-files-with-org-mode/][Unit Testing]] (this post)

* Literate Programming

Literate programming is many things to many people. I started to write about it on this blog and I will
continue in the coming months. However what I want to do with this blog post is to discuss another important
aspect (at least to me) of Literate Programming, which is that literate programming concepts and principles
leads to create tools (such as Org-mode with Emacs) that help developers to perform the development process in
a single document such that their focus is not distracted.

