blog/2016/09/14/creating-and-running-unit-tests-directly-in-source-files-with-org-mode/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>Creating-and-Running-Unit-Tests-Directly-in-Source-Files-with-Org-mode - EMACS-DOCUMENT</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="lujun9972" />
  <link rel="stylesheet" href="http://lujun9972.github.io/emacs-document/media/css/main.css" type="text/css"/>
  <link rel="stylesheet" href="http://lujun9972.github.io/emacs-document/media/css/comment.css" type="text/css"/>
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="http://lujun9972.github.io/emacs-document/">EMACS-DOCUMENT</a></h1>
    <p>=============&gt;集思广益</p>
    <nav class="site-nav">
      <div class="menu-icon">
        <svg viewBox="0 0 18 15">
          <path d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0 h15.031C17.335,0,18,0.665,18,1.484L18,1.484z" fill="#ffff00"/>
          <path d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484 h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z" fill="#ffff00"/>
          <path d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0 c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z" fill="#ffff00"/>
        </svg>
      </div>
      <ul class="trigger">
        <li><a href="http://lujun9972.github.io/emacs-document/years/">Years</a></li>
        <li><a href="http://lujun9972.github.io/emacs-document/authors/">Authors</a></li>
        <li><a href="http://lujun9972.github.io/emacs-document/tags/">Tags</a></li>
        <li><a href="http://lujun9972.github.io/emacs-document/about/">About</a></li>
        <li><a href="https://github.com/lujun9972/emacs-document">Github</a></li>
        <li><a href="http://lujun9972.github.io/emacs-document/rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="http://www.google.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="lujun9972.github.io/emacs-document">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">Creating-and-Running-Unit-Tests-Directly-in-Source-Files-with-Org-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Literate Programming</a></li>
<li><a href="#orgheadline2">2. Unit Testing in Org-mode (for Clojure)</a></li>
<li><a href="#orgheadline3">3. Running One or Multiple Tests</a></li>
<li><a href="#orgheadline4">4. Conclusion</a></li>
</ul>
</div>
</div>
<p>
Developing a computer program is not an easy task. The process needs a constant focus. Any interruption of
that process means that time is spent re-focusing on it and errors are more prone to be introduced. The
process involves analyzing a problem to solve by executing a series of steps. It involves writing about the
problem we are trying to solve and writing about the solution we found to solve it. Finally it involves
writing test procedures that can run to make sure that the current state of the implementation of the solution
behaves as expected and that expected behavior is not altered by subsequent modifications.
</p>

<p>
The problem I have been struggling with for the past 19 years — common to all programmers — is that each part
of this development process was performed in a cascade. The tools available, and the methods employed, forced
me to perform each of these steps in isolation and then to iterate how to:
</p>

<ol class="org-ol">
<li>Analyze a problem</li>
<li>Code a solution to the problem</li>
<li>Document the implementation</li>
<li>Create tests for the implementation</li>
<li>If the problem changed, or the solution needed fixing, iterate these same isolated steps from from 1 to 4.</li>
</ol>

<p>
The problem is that keeping the focus, and more importantly having the willpower (literally) to perform each
step under the pressure of deadlines, between meetings, etc., is nearly impossible to do right. Normally the
steps 1 and 2 will be done, but then steps 3 and 4 will be postponed until tomorrow (which never comes…)
</p>

<p>
I don’t think there is any definitive solution to solve this situation. Developing computer programs won’t
ever be an easy task, and focus will always be warranted. However I think there are methodologies and tools
that can be adopted to smooth the process. But one best practice that I think goes quite a bit of the way to
address this problem is to have a single document become the focal point of the overall process.
</p>

<p>
What we want is to be able to perform the process with a single tool and in a single document such that we
only have to focus on it without having to refocus on different tools in different windows all the time during
the development process.
</p>

<p>
In this blog post, I will describe a way to develop, and run, the unit tests (step 4) while keeping the focus
on writing about the solution and implementing it, all in the same (Org-mode) document.
</p>

<p>
This blog post belong to a series of posts about Literate [Clojure] Programming:
</p>

<ul class="org-ul">
<li><a href="http://fgiasson.com/blog/index.php/2016/07/06/literate-clojure-programming-using-org-mode/">Project folder structure</a></li>
<li><a href="http://fgiasson.com/blog/index.php/2016/08/11/literate-clojure-programming-anatomy-of-a-org-mode-file/">Anatomy of a Org-mode file</a></li>
<li>Tangling all project files</li>
<li>Publishing documentation in multiple formats</li>
<li><a href="http://fgiasson.com/blog/index.php/2016/05/30/creating-and-running-unit-tests-directly-in-source-files-with-org-mode/">Unit Testing</a> (this post)</li>
</ul>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Literate Programming</h2>
<div class="outline-text-2" id="text-1">
<p>
Literate programming is many things to many people. I started to write about it on this blog and I will
continue in the coming months. However what I want to do with this blog post is to discuss another important
aspect (at least to me) of Literate Programming, which is that literate programming concepts and principles
leads to create tools (such as Org-mode with Emacs) that help developers to perform the development process in
a single document such that their focus is not distracted.
</p>
</div>
</div>
