raw/Creating-and-Running-Unit-Tests-Directly-in-Source-Files-with-Org-mode.org
* Unit Testing in Org-mode (for Clojure)

What I want to show in this blog post is how we can use Org-mode to:

 1. Create a series of unit tests directly where it matters (right below the function to test)
 2. Run the tests when it matters (all the time, while developing or improving the tested function).

Unit tests can be used for a lot of different tasks. The main task is to test the behavior of a function and
to make sure that any future improvements to that function ends up with the expected behavior. But unit tests
can also be used as documentation about all of the ways that a function can be used in code, how their
parameters work and what is expected, etc. Whatever the reason, it is really helpful to have the tests
side-by-side with the function’s code. In most, if not almost all, development environments this is impossible
to get. However, this is really possible with Org-mode and I think this is a really effective way to develop
computer software.

Now, let’s figure out how we could properly define unit tests directly into Org-mode files while developing an
application. The goal is to let unit tests be developed at the same time as we develop the code and the
discussions surrounding the code. We shouldn’t have 4 distinct steps: we should do all of them, at the same
time, in the same document. The goal is that all this should happen at the same time such that the focus
doesn’t change all the time.

Let’s start with a simple function that gives the factorial of a number n.

#+BEGIN_SRC clojure
(defn n!
  [n]
  (loop [x n 
         f 1]
    (if (or (= x 1)
            (= x 0))
      f
      (recur (dec x) (* f x)))))
#+END_SRC

Now let’s use the function to see what it returns:

#+BEGIN_SRC clojure
(n! 10)

3628800
#+END_SRC

Now let’s define some tests to make sure that this implementation works as expected:

#+BEGIN_SRC clojure
(require '[clojure.test :refer :all])

(deftest test-n!-0
  (testing "Testing the n! function for the value 0"
    (is (= 1 (n! 0)))))

(deftest test-n!-1
  (testing "Testing the n! function for the value 1"
    (is (= 1 (n! 1)))))

(deftest test-n!-2
  (testing "Testing the n! function for the value 2"
    (is (= 2 (n! 2)))))

(deftest test-n!-4
  (testing "Testing the n! function for the value 4"
    (is (= 24 (n! 4)))))

(deftest test-n!-5
  (testing "Testing the n! function for the value 5"
    (is (= 120 (n! 5)))))

(deftest test-n!-5-fails
  (testing "Testing the n! function for the value 5 that fails"
    (is (= 121 (n! 5)))))
#+END_SRC

Then we can run all the tests at once:

#+BEGIN_SRC clojure 
(run-tests)
#+END_SRC

#+BEGIN_EXAMPLE
Testing user

FAIL in (test-n!-5-fails) (form-init2702185496610974397.clj:25)
Testing the n! function for the value 5 that fails
expected: (= 121 (n! 5))
  actual: (not (= 121 120))

Ran 6 tests containing 6 assertions.
1 failures, 0 errors.
#+END_EXAMPLE

There are a few things we have to understand regarding how org-mode and clojure work together. When code
blocks are executed directly from a Org-mode document, all of the Clojure code is executed in the namespace
started by Cider, namely the user namespace. When we first define the n! function then it gets defined in the
user namespace, and then when we define the tests, they get defined in that namespace as well. Finally when we
call the run-tests function without any parameter, then it runs the tests from the current namespace, which is
user.

This is why it works flawlessly: because each block is executed from the same Clojure namespace; everything
runs from there. If I update that function in the future, I will be able to re-run the tests directly from
that same development context without having to switch to another file or anything.

This is really interesting since we can define the functions that compose our application, then we can
immediately start writing the tests to make sure that the function behaves appropriately as expected, and we
can run the tests as often as we want, directly from the same context (development document). Then every time
I save the Org-mode document, then it gets “tangled” into the tests suites that will be normally be run when
the application get compiled, or used in other contexts that requires these tests to run. (Note that “tangle”
is an Org-mode term for generating only the code from an Org-mode document.)

What is fantastic with Org-mode is that every time you execute every code block in the document by pressing
C-c C-v b you define the functions and the unit tests in the default namespace, you tangle the code, and you
execute all the code which includes the tests and immediately see, contextually in your work, if any
modifications you made to your code broke some earlier assumptions.

